{"_id":{"$oid":"66385517ab2a352eba993f69"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense or suspence thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true}
{"_id":{"$oid":"6639a10fab2a352eba993f6a"},"Title":"Eternal Sunshine of the Spotless Mind","Description":"When their relationship turns sour, a couple undergoes a medical procedure to have each other erased from their memories forever.","Genre":{"Name":"Romance","Description":"Romance films involve romantic love stories recorded in visual media for broadcast in theatres or on television that focus on passion, emotion, and the affectionate romantic involvement of the main characters. Typically their journey through dating, courtship or marriage is featured."},"Director":{"Name":"Michel Gondry","Bio":"Michel Gondry is a French filmmaker noted for his inventive visual style and distinctive manipulation of mise en scène.","Birth":"1963"},"ImagePath":"eternalsunshineofthespotlessmind.png","Featured":false}
{"_id":{"$oid":"6639a158ab2a352eba993f6b"},"Title":"Adaptation","Description":"A lovelorn screenwriter becomes desperate as he tries and fails to adapt ''The Orchid Thief'' by Susan Orlean for the screen..","Genre":{"Name":"Drama","Description":"Drama is a genre of film intended to be more serious than humorous in tone. Drama films often focus on the emotional and relational development of realistic characters, relying heavily on the dramatic themes taken from intense, real-life issues."},"Director":{"Name":"Spike Jonze","Bio":"Adam Spiegel, known professionally as Spike Jonze, is an American filmmaker, actor and photographer. His work includes films, commercials, music videos, skateboard videos and television.","Birth":"1969"},"ImagePath":"adaptation.png","Featured":false}
{"_id":{"$oid":"6639a22bab2a352eba993f6c"},"Title":"Kiki's Delivery Service","Description":"A young witch, on her mandatory year of independent life, finds fitting into a new community difficult while she supports herself by running an air courier service.","Genre":{"Name":"Fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds."},"Director":{"Name":"Hayao Miyazaki","Bio":"Hayao Miyazaki is a Japanese animator, filmmaker, and manga artist. A founder of Studio Ghibli, he has attained international acclaim as a masterful storyteller and creator of Japanese animated feature films, and is widely regarded as one of the most accomplished filmmakers in the history of animation.","Birth":"1941"},"ImagePath":"kikisdeliveryservice.png","Featured":false}
{"_id":{"$oid":"6639a237ab2a352eba993f6d"},"Title":"Scott Pilgrim vs. the World","Description":"In a surreal version of Toronto, a young man must defeat his new girlfriend's seven evil exes one by one in order to win her heart.","Genre":{"Name":"Comedy","Description":"A comedy film is a film genre that emphasizes humor. These films are designed to amuse audiences and make them laugh."},"Director":{"Name":"Edgar Wright","Bio":"Edgar Howard Wright is an English filmmaker and actor. He is known for his fast-paced and kinetic, satirical genre films, which feature extensive usage of expressive popular music, Steadicam tracking shots, dolly zooms and a signature editing style that includes transitions, whip pans and wipes.","Birth":"1974"},"ImagePath":"scottpilgrimvstheworld.png","Featured":false}
{"_id":{"$oid":"6639a241ab2a352eba993f6e"},"Title":"Hot Fuzz","Description":"An overachieving London police sergeant is transferred to a village where the easygoing officers object to his fervor for regulations, all while a string of grisly murders strikes the town.","Genre":{"Name":"Comedy","Description":"A comedy film is a film genre that emphasizes humor. These films are designed to amuse audiences and make them laugh."},"Director":{"Name":"Edgar Wright","Bio":"Edgar Howard Wright is an English filmmaker and actor. He is known for his fast-paced and kinetic, satirical genre films, which feature extensive utilisation of expressive popular music, Steadicam tracking shots, dolly zooms and a signature editing style that includes transitions, whip pans and wipes.","Birth":"1974"},"ImagePath":"hotfuzz.png","Featured":false}
{"_id":{"$oid":"6639a24eab2a352eba993f6f"},"Title":"Spirited Away","Description":"During her family''s move to the suburbs, a sullen 10-year-old girl wanders into a world ruled by gods, witches and spirits, and where humans are changed into beasts.","Genre":{"Name":"Fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds."},"Director":{"Name":"Hayao Miyazaki","Bio":"Hayao Miyazaki is a Japanese animator, filmmaker, and manga artist. A founder of Studio Ghibli, he has attained international acclaim as a masterful storyteller and creator of Japanese animated feature films, and is widely regarded as one of the most accomplished filmmakers in the history of animation.","Birth":"1941"},"ImagePath":"spiritedaway.png","Featured":false}
{"_id":{"$oid":"6639a25aab2a352eba993f70"},"Title":"The Departed","Description":"An undercover cop and a mole in the police attempt to identify each other while infiltrating an Irish gang in South Boston.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Martin Scorcese","Bio":"Martin Charles Scorsese is an American filmmaker. He emerged as one of the major figures of the New Hollywood era. He has received many accolades, including an Academy Award, four BAFTA Awards, three Emmy Awards, a Grammy Award, and three Golden Globe Awards.","Birth":"1942"},"ImagePath":"thedeparted.png","Featured":false}
{"_id":{"$oid":"6639a263ab2a352eba993f71"},"Title":"I Heart Huckabees","Description":"A husband-and-wife team play detective, but not in the traditional sense. Instead, the happy duo helps others solve their existential issues, the kind that keep you up at night, wondering what it all means.","Genre":{"Name":"Comedy","Description":"A comedy film is a film genre that emphasizes humor. These films are designed to amuse audiences and make them laugh."},"Director":{"Name":"David O. Russell","Bio":"David Owen Russell is an American film director, screenwriter and producer.","Birth":"1958"},"ImagePath":"ihearthuckabees.png","Featured":false}
{"_id":{"$oid":"6639a26dab2a352eba993f72"},"Title":"Memories of Murder","Description":"In a small Korean province in 1986, two detectives struggle with the case of multiple young women being found raped and murdered by an unknown culprit.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Bong Joon-ho","Bio":"Bong Joon-ho is a South Korean film director, producer and screenwriter. The recipient of three Academy Awards, his filmography is characterised by emphasis on social and class themes, genre-mixing, black humor, and sudden tone shifts.","Birth":"1969"},"ImagePath":"memoriesofmurder.png","Featured":false}
{"_id":{"$oid":"6639a277ab2a352eba993f73"},"Title":"Redline","Description":"A story about the most popular racing event in the galaxy, the Redline, and the various racers who compete in it.","Genre":{"Name":"Science Fiction","Description":"Science fiction (or sci-fi or SF) is a film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, spacecraft, robots, cyborgs, mutants, interstellar travel, time travel, or other technologies."},"Director":{"Name":"Takeshi Koike is a Japanese animator, illustrator and film director.","Bio":"Bong Joon-ho is a South Korean film director, producer and screenwriter. The recipient of three Academy Awards, his filmography is characterised by emphasis on social and class themes, genre-mixing, black humor, and sudden tone shifts.","Birth":"1968"},"ImagePath":"redline.png","Featured":false}
